W7D2/musicapp/app/models/user.rb

    def self.find_by_credentials(email, password)
        # find the user with the corresponding email
        user = self.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "leah@holipena.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64 # update instance attr w/ new token
        self.save! # save updated instance to the db
---
UPDATE "users" SET "updated_at" = ?, "session_token" = ? WHERE "users"."id" = ?  [["updated_at", "2020-07-15 00:19:25.474358"], ["session_token", "DZYurCXY6wri1SXMxhzYYQ"], ["id", 4]]