W7D2/musicapp/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "-ZorXohgqBL58ZunTeKkyw"], ["LIMIT", 1]]
---
    def current_user
        # current_user is the previously set current_user OR the user that
        # has the same session token as the current session's session token
        @current_user ||= User.find_by(session_token: session[:session_token])