W7D2/musicapp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        # find the user based off the id param/wildcard passed in
        @user = User.find_by(id: params[:id])

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest", "session_token") VALUES (?, ?, ?, ?, ?)
---
    def create # sign up action
        # create a user instance with params passed (email, pw)
        @user = User.new(user_params)
        # if we were able to save that user in our db (passed all validations)
        if @user.save!