W6D4/first_routes/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 32]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 18]]
SELECT "comments".* FROM "comments"
---
    def index
        if params.has_key?(:user_id)
            comments = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            comments = Comment.where(artwork_id: params[:artwork_id])
        else
            comments = Comment.all