W6D4/first_routes/app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."artwork_id" = $1  [["artwork_id", 21]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."favoriter_id" = $1  [["favoriter_id", 34]]
SELECT "favorites".* FROM "favorites"
---
    def index
        if params.has_key?(:artwork_id)
            favorite = Favorite.where(artwork_id: params[:artwork_id])

        elsif params.has_key?(:user_id)
            favorite = Favorite.where(favoriter_id: params[:user_id])
        else
            favorite = Favorite.all

INSERT INTO "favorites" ("favoriter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["favoriter_id", 37], ["artwork_id", 21], ["created_at", "2020-07-09 23:22:56.240540"], ["updated_at", "2020-07-09 23:22:56.240540"]]
---
    def create
        favorite = Favorite.new(favorite_params)
        if favorite.save