W6D4/first_routes/app/controllers/likes_controller.rb

    def index
        # if params[:likeable_type] == "Artwork"
        #     like = Like.where(likeable_type: params[:likeable_type], likeable_id: params[:likeable_id], user_id: params[:user_id])

        # elsif params[:likeable_type] = "Comment"
        #     like = Like.where(likeable_id: params[:comment_id])
        # elsif params.has_key?(:user_id)
        #     like = Like.where(user_id: params[:user_id])
        # else
        #     like = Like.all
        # end
        if params[:artwork_id]
            like = Like.where(likeable_id: params[:artwork_id])
        elsif params[:comment_id]
            like = Like.where(likeable_id: params[:comment_id])
        elsif params[:user_id]
            like = Like.where(user_id: params[:user_id])
        else
            like = Like.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1  [["likeable_id", 19]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 32]]
SELECT "likes".* FROM "likes"

    def create
        # like = 'hello'
        # if params[:likeable_type] == "Comment"
        #     like = Like.new(like_params)
        # elsif params.has_key?(:comment_id)
        #     like = Like.new(like_params)
        # end
        like = Like.new(like_params)
        if like.save
---
INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Comment"], ["likeable_id", 4], ["created_at", "2020-07-09 23:14:02.423813"], ["updated_at", "2020-07-09 23:14:02.423813"], ["user_id", 36]]

    def destroy
        like = Like.find(params[:id])
        like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]