W6D4/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jim"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        # if query string
        if params.has_key?(:username)
           user = User.find_by(username: params[:username])
           if user == nil
            render json: 'No user found'
           else
           render json: user
           end
        else
            # find user. if user exists and if user doesnt
            #else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Halpert"], ["updated_at", "2020-07-08 23:22:02.737691"], ["id", 18]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)