W6D3/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 8], ["viewer_id", 22], ["created_at", "2020-07-08 23:53:34.104520"], ["updated_at", "2020-07-08 23:53:34.104520"]]
---
    def create
        share = ArtworkShare.new(share_params)
        if share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 7]]
---
    def destroy
        share = ArtworkShare.find(params[:id])
        share.destroy