W6D3/first_routes/app/controllers/artworks_controller.rb

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Most Famous Painting"], ["updated_at", "2020-07-08 23:38:48.008766"], ["id", 8]]