W6D3/first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Halpert"], ["updated_at", "2020-07-08 23:22:02.737691"], ["id", 18]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)