W6D5/cats_99/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "1021-09-09"], ["description", "He is from the past"], ["updated_at", "2020-07-10 23:32:04.108889"], ["id", 10]]