W11D4/benchBnb/app/controllers/api/benches_controller.rb

    def index
        @benches = Bench.all
---
SELECT "benches".* FROM "benches"

    def create
        @bench = Bench.new(bench_params)

        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "near the park"], ["lat", 37.733152], ["lng", -122.428076], ["created_at", "2020-08-15 05:53:36.243371"], ["updated_at", "2020-08-15 05:53:36.243371"]]